<Qucs Schematic 25.2.0>
<Properties>
  <View=-7004,-4896,8744,3375,0.683013,4723,3287>
  <Grid=10,10,1>
  <DataSet=fm signal.dat>
  <DataDisplay=fm signal.dpl>
  <OpenDisplay=0>
  <Script=fm signal.m>
  <RunScript=0>
  <showFrame=0>
  <FrameText0=Название>
  <FrameText1=Чертил:>
  <FrameText2=Дата:>
  <FrameText3=Версия:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <GND * 1 1320 570 0 0 0 0>
  <R R1 1 1640 460 -26 15 0 0 "1 kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <GND * 1 1680 460 0 0 0 0>
  <Eqn Eqn1 1 280 130 -37 17 0 0 "amp=1" 1 "fc=0.83e9" 1 "fm=100" 1 "fdev=500" 1 "mf=fdev/fm" 1 "yes" 0>
  <Vac V1 1 250 460 18 -26 0 1 "1 V" 1 "fc" 1 "0" 0 "0" 0 "0" 0 "0" 0>
  <GND * 1 250 490 0 0 0 0>
  <R R2 1 570 380 -26 15 0 0 "1 kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <GND * 1 600 380 0 0 0 0>
  <.TR TR1 1 700 130 0 78 0 0 "lin" 1 "0" 1 "100 ns" 1 "1000" 1 "Trapezoidal" 0 "2" 0 "1 ns" 0 "1e-16" 0 "150" 0 "0.001" 0 "1 pA" 0 "1 uV" 0 "26.85" 0 "1e-3" 0 "1e-6" 0 "1" 0 "CroutLU" 0 "no" 0 "yes" 0 "0" 0>
  <Vfile V2 1 1320 540 18 -26 0 1 "E:/MPEI/YPOS/lr1/PODG_1_RUS/chm_signal1.txt" 1 "linear" 0 "no" 0 "1" 0 "0" 0>
  <GND * 1 2380 570 0 0 0 0>
  <R R3 1 2700 460 -26 15 0 0 "1 kOhm" 1 "26.85" 0 "0.0" 0 "0.0" 0 "26.85" 0 "european" 0>
  <GND * 1 2740 460 0 0 0 0>
  <Vfile V3 1 2380 540 18 -26 0 1 "E:/MPEI/YPOS/lr1/PODG_1_RUS/chm_signal2.txt" 1 "linear" 0 "no" 0 "1" 0 "0" 0>
  <Eqn Eqn2 1 410 140 -37 18 0 0 "SMo=2*Time2Freq(Vin.Vt, time)" 1 "SMo2=2*Time2Freq(Vin2.Vt, time)" 1 "SMo3=2*Time2Freq(Vin3.Vt, time)" 1 "yes" 0>
</Components>
<Wires>
  <1320 460 1320 510 "" 0 0 0 "">
  <1320 460 1610 460 "" 0 0 0 "">
  <1670 460 1680 460 "" 0 0 0 "">
  <250 380 250 430 "" 0 0 0 "">
  <250 380 540 380 "" 0 0 0 "">
  <2380 460 2380 510 "" 0 0 0 "">
  <2380 460 2670 460 "" 0 0 0 "">
  <2730 460 2740 460 "" 0 0 0 "">
  <250 380 250 380 "Vin2" 280 350 0 "">
  <1320 510 1320 510 "Vin" 1350 480 0 "">
  <2380 510 2380 510 "Vin3" 2410 480 0 "">
</Wires>
<Diagrams>
  <Rect 1260 760 963 150 3 #c0c0c0 1 00 1 0 0.002 0.05 1 -1.2 1 1.2 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"ngspice/tran.v(vin)" #0000ff 0 3 0 0 0>
  </Rect>
  <Rect 1270 987 570 147 3 #c0c0c0 1 00 0 7e+08 1e+08 1e+09 1 -0.0911332 0.5 1.00247 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"SMo" #0000ff 0 3 0 0 0>
	  <Mkr 7.3e+08 117 -103 3 0 0>
	  <Mkr 8.3e+08 307 -195 3 0 0>
	  <Mkr 9.3e+08 497 -103 3 0 0>
  </Rect>
  <Rect 70 770 963 150 3 #c0c0c0 1 00 1 0 5e-09 1e-07 1 -1.2 1 1.2 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"ngspice/tran.v(vin2)" #0000ff 0 3 0 0 0>
  </Rect>
  <Rect 80 987 570 147 3 #c0c0c0 1 00 0 7e+08 1e+08 1e+09 1 -0.0988166 0.5 1.08698 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"SMo2" #0000ff 1 3 0 0 0>
	  <Mkr 8.3e+08 603 -125 3 0 0>
  </Rect>
  <Rect 2320 760 963 150 3 #c0c0c0 1 00 1 0 1e-08 1e-09 1 -1.2 1 1.2 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"ngspice/tran.v(vin)" #0000ff 0 3 0 0 0>
  </Rect>
  <Rect 2330 987 570 147 3 #c0c0c0 1 00 0 7e+08 1e+08 1e+09 1 -0.0965126 0.5 1.06164 1 -1 1 1 315 0 225 1 0 0 "" "" "">
	<"SMo3" #0000ff 0 3 0 0 0>
	  <Mkr 8.3e+08 307 -195 3 0 0>
	  <Mkr 7.3e+08 117 -77 3 0 0>
	  <Mkr 9.3e+08 497 -77 3 0 0>
  </Rect>
</Diagrams>
<Paintings>
</Paintings>
